main.floors.MT18=
{
    "floorId": "MT18",
    "title": "主塔 18 层",
    "name": "18",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "",
    "firstArrive": [
        "\t[弱智,default]咦?這裡是...研究室?沒想到塔裡還有這種地方"
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "值",
            "true": []
        },
        {
            "type": "if",
            "condition": "flag:__kill__",
            "true": [
                {
                    "type": "show",
                    "loc": [
                        [
                            10,
                            6
                        ]
                    ]
                }
            ],
            "false": [
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            6
                        ]
                    ],
                    "remove": true
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "10,6": [
            "\t[弱智,default][就在弱智往前探索的同時，旁邊的書架倒下了]",
            "\t[弱智,default](畫面一黑，再次亮起時弱智旁邊出現書堆)",
            "\t[弱智,default]好痛，甚麼鬼汪",
            "\t[弱智,default]怪了怎麼這裡也有一堆的書汪",
            "\t[弱智,default][弱智從書堆裡搜尋了一下，最終鎖定了一本書]",
            "\t[弱智,default]「魔塔寄錄」，看起來對了解這座塔來說非常重要汪",
            "\t[弱智,default][弱智翻看起了這本書，書中詳細描述了創立這座魔塔的目的]",
            "\t[弱智,default][「魔塔是由勇者國所建立的監獄，用於處理那些難以接受正道的傢伙」]",
            "\t[弱智,default][「為了避免逃獄的可能性，整座塔被施下了只能進不能出的魔法」]",
            "\t[弱智,default][「唯有在塔頂的典獄長室才能關閉這個魔法」]",
            "\t[弱智,default]看來只要到了塔頂就能夠出去了汪",
            "\t[弱智,default]嗯?後面竟然還有汪",
            "\t[弱智,default][但隨著向後翻閱，一個不好的假設出現在了弱智的腦中]",
            "\t[弱智,default][「但隨著時間的推移，關押的人越來越難以控制，甚至已經發生多次攻進典獄長室的事件」]",
            "\t[弱智,default][「因此整座塔被施下了魔法，只要待在塔中超過一定時間，就會變形成容易擊殺的怪物」]",
            "\t[弱智,default]......",
            "\t[弱智,default]那隻怪物......",
            "\t[弱智,default]不對，不可能的汪",
            "\t[弱智,default]先去看看塔頂到底發生了什麼，再去確定吧汪"
        ]
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144,144,144,144,144,144, 88,144,144,144,144,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  0,  0,  0,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  0,  2,  0,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  0,  2,  0,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  0,  2,  0,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  2,  2,  0,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  2,  0,  0,144,144],
    [144,144,  0,  0,  0,  0,  0,  0,  2,  0,  0,144,144],
    [144,144,  0,  0,  0,  2,  2,  2,  2,  0,  0,144,144],
    [144,144,  0,  0,  0,  2,  0,  0,  0,  0,  0,144,144],
    [144,144,144,144,144,144, 87,144,144,144,144,144,144],
    [144,144,144,144,144,144,144,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

]
}