main.floors.Shop=
{
    "floorId": "Shop",
    "title": "主塔 10 层",
    "name": "10",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "",
    "firstArrive": [
        "\t[店長,triangle.png]嗯?現在還有人來?",
        "\t[弱智,default]這座塔裡竟然有商店?你這邊是賣甚麼的汪",
        "\t[店長,triangle.png]強化的道具，難不成你還打算用手上的東西打到塔頂嗎?",
        "\t[弱智,default](雖然已經有了神器，但還是先看看這邊都賣甚麼吧)",
        {
            "type": "openShop",
            "id": "shop1",
            "open": true
        },
        {
            "type": "animate",
            "name": "EMsikao",
            "loc": [
                6,
                9
            ]
        },
        {
            "type": "animate",
            "name": "SLyiwen",
            "loc": [
                6,
                9
            ]
        },
        "\t[弱智,default]不是，我又被騙了嗎汪",
        "\t[弱智,default]我剛剛到底花錢買了甚麼啊汪",
        "\t[弱智,default]那個可惡的主......我是說兔子",
        "\t[店長,triangle.png]咪......兔子嗎?",
        "\t[弱智,default]對阿，可惡的兔子，把我身上的錢都騙走了，然後只給我這把破劍汪",
        "\t[店長,triangle.png]可是你看起來很興奮啊",
        "\t[弱智,default]我不是，我沒有汪",
        "\t[店長,triangle.png]那就當作你說的是真的吧咪",
        "\t[弱智,default]不是，我說的真的，你聽我說汪"
    ],
    "eachArrive": [
        {
            "type": "if",
            "condition": "(flag:__shopSecond__ ==1)",
            "true": [
                "\t[店長,trinagle.png]嗯?原來你還活著",
                {
                    "type": "switch",
                    "condition": "Math.floor(Math.random() * 3);",
                    "caseList": [
                        {
                            "case": "0",
                            "action": [
                                {
                                    "type": "comment",
                                    "text": "当判别值是值的场合执行此事件"
                                },
                                "\t[弱智,default]不要詛咒我啊汪"
                            ]
                        },
                        {
                            "case": "1",
                            "action": [
                                {
                                    "type": "comment",
                                    "text": "当没有符合的值的场合执行default事件"
                                },
                                "\t[弱智,default]甚麼話這是汪"
                            ]
                        },
                        {
                            "case": "2",
                            "action": [
                                {
                                    "type": "comment",
                                    "text": "当没有符合的值的场合执行default事件"
                                },
                                "\t[弱智,default]你為甚麼好像很意外的樣子汪"
                            ]
                        }
                    ]
                },
                {
                    "type": "exit"
                }
            ],
            "false": [
                {
                    "type": "setValue",
                    "name": "flag:__shopSecond__",
                    "value": "1"
                }
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "6,5": [
            {
                "type": "openShop",
                "id": "shop1",
                "open": true
            }
        ]
    },
    "changeFloor": {
        "6,10": {
            "floorId": "MT4",
            "loc": [
                3,
                2
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,10": {
            "0": {
                "condition": "flag:__Getter2__===1",
                "currentFloor": true,
                "priority": 1,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "while",
                        "condition": "(core.getHeroLoc('y')  >5)",
                        "data": [
                            {
                                "type": "moveHero",
                                "time": 25,
                                "steps": [
                                    "up:1"
                                ]
                            }
                        ]
                    },
                    "\t[弱智,default]幹您娘，我又被坑了啊啊啊啊",
                    {
                        "type": "animate",
                        "name": "SLyiwen",
                        "loc": [
                            6,
                            4
                        ]
                    },
                    "\t[弱智,default]我的盾牌被他搶走了汪",
                    "\t[弱智,default]我怎麼會被同樣一個人騙兩次啊",
                    "\t[弱智,default]他跟我說能把盾牌強化成更強的型態，我就把盾牌交出去了啊啊啊啊",
                    "\t[店長,triangle.png]嗯......這個免費送你咪",
                    {
                        "type": "setValue",
                        "name": "item:sword2",
                        "value": "1"
                    },
                    "獲得了一把漂亮的劍",
                    "\t[弱智,default]真的?這麼好?",
                    "\t[弱智,default]怪了，我怎麼反而感覺有點失望汪",
                    {
                        "type": "animate",
                        "name": "EMsikao",
                        "loc": [
                            6,
                            4
                        ]
                    },
                    "\t[店長,triangle.png]咪",
                    "\t[店長,triangle.png]對了，那個兔子，或者說你的主人的名字叫蓋特",
                    "\t[店長,triangle.png]在強化成更強的型態這點上，他沒有欺騙你",
                    "\t[弱智,default]何意味",
                    "\t[店長,triangle.png]總之你可以相信他，下次遇到的時候直接問本人吧",
                    {
                        "type": "animate",
                        "name": "EMsikao",
                        "loc": [
                            6,
                            5
                        ]
                    },
                    "\t[弱智,default]我會試試看的"
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,141,141,141,141,141,141,141,141,141,  0,  0],
    [  0,  0,141,  0,  0,  0,  0,  0,  0,  0,141,  0,  0],
    [  0,  0,141,80137,80138,80138,352,80138,80138,80139,141,  0,  0],
    [  0,  0,141,80145,80146,80146,80146,80146,80146,80147,141,  0,  0],
    [  0,  0,141,  0,  0,  0,  0,  0,  0,  0,141,  0,  0],
    [  0,  0,141,  0,  0,  0,  0,  0,  0,20116,141,  0,  0],
    [  0,  0,141,20201,20202,20203,  0,  0,  0,  0,141,  0,  0],
    [  0,  0,141,20209,20210,20211,  0,  0,  0,  0,141,  0,  0],
    [  0,  0,141,141,141,141,  0,141,141,141,141,  0,  0],
    [  0,  0,  0,  0,  0,  0, 17,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036],
    [10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,  0,  0,  0,  0,  0,  0,  0,  0,  0,10036,10036],
    [10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036],
    [10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036,10036]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,80174,  0,  0,  0,  0,  0,80174,  0,  0,  0],
    [  0,  0,  0,80158,  0,  0,  0,  0,80159,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "flyPoint": [
        6,
        9
    ],
    "bgm": "shop.m4a"
}