main.floors.story_1=
{
    "floorId": "story_1",
    "title": "皇宮",
    "name": "皇宮",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X20033",
    "firstArrive": [
        {
            "type": "hideStatusBar"
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 100,
            "keep": true
        },
        {
            "type": "autoText",
            "text": "我，弱智，一個勇者國的底層勇者，現在正在面臨我人生中最大的危機",
            "time": 1000
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\t[國王,king.png]勇者弱智，你已經被選中成為下一個去高塔裡拯救公主的人，快去準備出發吧",
        "\t[弱智,idoit.png]媽的，不是",
        "\t[弱智,idoit.png]我記得我的排名不是很靠後的嗎?怎麼想都應該是戰力比較強的那些人先去才對啊，比如高興前輩那種的。",
        "\t[弱智,idoit.png]這麼說來好像好幾個月沒看到他了，等等，不會吧",
        "\t[弱智,idoit.png]總不會勇者國排名在我前面的勇者都沒從塔裡出來吧",
        "\t[弱智,idoit.png]嘶...好像也只有這個可能了，畢竟我的父母幫我買的勇者頭銜裡，條件大概是除非勇者國其他勇者都處於無法行動的狀態，否則我應該不會被派出去的才對。",
        "\t[弱智,idoit.png]......",
        "\t[弱智,idoit.png]不對",
        "\t[弱智,idoit.png]不對不對不對 不對不對不對 不對不對不對 不對不對不對",
        "\t[弱智,idoit.png]不行的阿，我做不到阿，幹這就是平常訓練少的後果嗎，完全做不到哇",
        "\t[弱智,idoit.png]反正勇者國的所有人都那麼正直又富有正義感，那些不是勇者的人稍微訓練一下肯\n定就比我強了吧",
        "\t[弱智,idoit.png]仔細想想，我們國家的畫風也太奇怪了吧，為甚麼所有人都那麼陽光正向阿，我的\n陰暗面都被淨化了阿",
        "\t[弱智,idoit.png]發生衝突後過沒十秒就開心地互相祝福對方又是什麼鬼啦",
        "\t[弱智,idoit.png]......",
        "\t[弱智,idoit.png]好像...也只能走了，從勇者國被趕出去我就完了啊",
        "\t[弱智,idoit]......收拾收拾走了吧，該去那座「魔塔」",
        {
            "type": "showStatusBar"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,137,  0,  0,  0,  0,  0,132,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20200,  0,  0,  0,  0,  0,20200,  0,  0,  0],
    [  0,  0,  0,20208,  0,  0,  0,  0,  0,20208,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

]
}